output/2023-07-24-19-11.log
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.129 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1214000
HTML transferred:       1044000 bytes
Requests per second:    7735.51 [#/sec] (mean)
Time per request:       12.927 [ms] (mean)
Time per request:       0.129 [ms] (mean, across all concurrent requests)
Transfer rate:          9125.48 [Kbytes/sec] received
                        9170.81 kb/s sent
                        18296.29 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.4      0       6
Processing:     1    7   7.5      5      55
Waiting:        0    7   7.5      5      51
Total:          1    8   8.8      5      56
Benchmark_Config
1000,100,1024
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        1044 bytes

Concurrency Level:      100
Time taken for tests:   0.054 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      1208000 bytes
Total body sent:        1214000
HTML transferred:       1044000 bytes
Requests per second:    18439.30 [#/sec] (mean)
Time per request:       5.423 [ms] (mean)
Time per request:       0.054 [ms] (mean, across all concurrent requests)
Transfer rate:          21752.61 [Kbytes/sec] received
                        21860.65 kb/s sent
                        43613.26 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.2      0       5
Processing:     2    4   2.4      3      11
Waiting:        2    4   2.4      3      11
Total:          2    5   3.5      3      15
Benchmark_Config
1000,100,2048
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        2068 bytes

Concurrency Level:      100
Time taken for tests:   0.063 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      2232000 bytes
Total body sent:        2238000
HTML transferred:       2068000 bytes
Requests per second:    15917.74 [#/sec] (mean)
Time per request:       6.282 [ms] (mean)
Time per request:       0.063 [ms] (mean, across all concurrent requests)
Transfer rate:          34695.69 [Kbytes/sec] received
                        34788.96 kb/s sent
                        69484.65 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       2
Processing:     1    6   4.7      5      20
Waiting:        1    6   4.7      5      20
Total:          1    6   5.1      5      21
Benchmark_Config
1000,100,4096
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        4116 bytes

Concurrency Level:      100
Time taken for tests:   0.069 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      4280000 bytes
Total body sent:        4286000
HTML transferred:       4116000 bytes
Requests per second:    14429.81 [#/sec] (mean)
Time per request:       6.930 [ms] (mean)
Time per request:       0.069 [ms] (mean, across all concurrent requests)
Transfer rate:          60312.08 [Kbytes/sec] received
                        60396.63 kb/s sent
                        120708.71 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       3
Processing:     2    6   4.7      5      21
Waiting:        1    6   4.8      5      21
Total:          2    7   5.4      5      23
Benchmark_Config
1000,100,8192
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        8212 bytes

Concurrency Level:      100
Time taken for tests:   0.073 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      8376000 bytes
Total body sent:        8382000
HTML transferred:       8212000 bytes
Requests per second:    13751.56 [#/sec] (mean)
Time per request:       7.272 [ms] (mean)
Time per request:       0.073 [ms] (mean, across all concurrent requests)
Transfer rate:          112483.50 [Kbytes/sec] received
                        112564.07 kb/s sent
                        225047.57 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0       4
Processing:     2    6   4.3      5      21
Waiting:        2    6   4.3      5      21
Total:          2    6   5.3      5      25
Benchmark_Config
1000,100,16384
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        16404 bytes

Concurrency Level:      100
Time taken for tests:   0.116 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      16569000 bytes
Total body sent:        16575000
HTML transferred:       16404000 bytes
Requests per second:    8621.95 [#/sec] (mean)
Time per request:       11.598 [ms] (mean)
Time per request:       0.116 [ms] (mean, across all concurrent requests)
Transfer rate:          139508.93 [Kbytes/sec] received
                        139559.45 kb/s sent
                        279068.38 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0       5
Processing:     3   10   5.5      7      28
Waiting:        2   10   5.5      7      28
Total:          3   10   6.6      7      32
Benchmark_Config
1000,100,32768
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        32788 bytes

Concurrency Level:      100
Time taken for tests:   0.127 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      32953000 bytes
Total body sent:        32959000
HTML transferred:       32788000 bytes
Requests per second:    7866.83 [#/sec] (mean)
Time per request:       12.712 [ms] (mean)
Time per request:       0.127 [ms] (mean, across all concurrent requests)
Transfer rate:          253159.82 [Kbytes/sec] received
                        253205.92 kb/s sent
                        506365.74 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       4
Processing:     3   11   6.2      9      41
Waiting:        3   11   6.2      9      41
Total:          3   11   6.8      9      43
Benchmark_Config
1000,100,65536
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        hertz
Server Hostname:        0.0.0.0
Server Port:            8888

Document Path:          /EchoService/Echo
Document Length:        65556 bytes

Concurrency Level:      100
Time taken for tests:   0.202 seconds
Complete requests:      1000
Failed requests:        0
Keep-Alive requests:    1000
Total transferred:      65721000 bytes
Total body sent:        65727000
HTML transferred:       65556000 bytes
Requests per second:    4945.65 [#/sec] (mean)
Time per request:       20.220 [ms] (mean)
Time per request:       0.202 [ms] (mean, across all concurrent requests)
Transfer rate:          317414.93 [Kbytes/sec] received
                        317443.91 kb/s sent
                        634858.84 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.2      0       6
Processing:     1   19   8.1     18      62
Waiting:        1   19   8.2     18      62
Total:          1   19   8.7     18      62